# ####################################################################

#  Created by Genus(TM) Synthesis Solution 23.10-p004_1 on Sun Feb 15 22:01:25 +07 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design top_addersubtractor

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports p_Clock]
set_load -pin_load 0.1 [get_ports {p_Z[15]}]
set_load -pin_load 0.1 [get_ports {p_Z[14]}]
set_load -pin_load 0.1 [get_ports {p_Z[13]}]
set_load -pin_load 0.1 [get_ports {p_Z[12]}]
set_load -pin_load 0.1 [get_ports {p_Z[11]}]
set_load -pin_load 0.1 [get_ports {p_Z[10]}]
set_load -pin_load 0.1 [get_ports {p_Z[9]}]
set_load -pin_load 0.1 [get_ports {p_Z[8]}]
set_load -pin_load 0.1 [get_ports {p_Z[7]}]
set_load -pin_load 0.1 [get_ports {p_Z[6]}]
set_load -pin_load 0.1 [get_ports {p_Z[5]}]
set_load -pin_load 0.1 [get_ports {p_Z[4]}]
set_load -pin_load 0.1 [get_ports {p_Z[3]}]
set_load -pin_load 0.1 [get_ports {p_Z[2]}]
set_load -pin_load 0.1 [get_ports {p_Z[1]}]
set_load -pin_load 0.1 [get_ports {p_Z[0]}]
set_load -pin_load 0.1 [get_ports p_Overflow]
set_load -pin_load 0.1 [get_ports vddio]
set_load -pin_load 0.1 [get_ports vssio]
set_load -pin_load 0.1 [get_ports vddcore]
set_load -pin_load 0.1 [get_ports vsscore]
set_false_path -from [get_ports p_Reset]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports p_Reset]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports p_Sel]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports p_AddSub]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_A[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_B[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {p_Z[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports p_Overflow]
set_dont_touch [get_cells corner_bottom_left]
set_dont_touch [get_cells corner_bottom_right]
set_dont_touch [get_cells corner_top_left]
set_dont_touch [get_cells corner_top_right]
set_dont_touch [get_cells {gen_input_pads[0].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[0].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[1].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[1].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[2].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[2].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[3].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[3].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[4].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[4].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[5].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[5].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[6].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[6].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[7].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[7].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[8].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[8].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[9].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[9].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[10].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[10].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[11].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[11].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[12].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[12].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[13].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[13].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[14].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[14].pad_B_inst}]
set_dont_touch [get_cells {gen_input_pads[15].pad_A_inst}]
set_dont_touch [get_cells {gen_input_pads[15].pad_B_inst}]
set_dont_touch [get_cells {gen_output_pads[0].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[1].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[2].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[3].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[4].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[5].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[6].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[7].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[8].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[9].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[10].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[11].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[12].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[13].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[14].pad_Z_inst}]
set_dont_touch [get_cells {gen_output_pads[15].pad_Z_inst}]
set_dont_touch [get_cells pad_addsub]
set_dont_touch [get_cells pad_clk]
set_dont_touch [get_cells pad_iovdd_inst]
set_dont_touch [get_cells pad_iovss_inst]
set_dont_touch [get_cells pad_ovfl]
set_dont_touch [get_cells pad_rst]
set_dont_touch [get_cells pad_sel]
set_dont_touch [get_cells pad_vdd_inst]
set_dont_touch [get_cells pad_vss_inst]
set_clock_uncertainty -setup 0.3 [get_clocks clk]
set_clock_uncertainty -hold 0.3 [get_clocks clk]
